In [3]:
import pandas as pd
import numpy as np

In [4]:
data = {"col1" : [1,2,3,4], "col2": [444,555,666,444], "col3":['abc', 'def', 'ghi','xyz']}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [7]:
#finding unique values in a data frame -> data does does not repeat-> think set
df["col2"].unique()

array([444, 555, 666])

In [8]:
#check the count of the unique values in the data frame 
df["col2"].nunique()

3

In [9]:
#value count -> gets you a tabe of the unique values and how many times they show up 
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [10]:
#selecting data ->

In [11]:
df[(df["col1"] > 2) & (df["col2"] < 500)]

   col1  col2 col3
3     4   444  xyz

In [12]:
#--->>

#APPLY method -> allows you to apply your custom function to a series

In [13]:
def times_2(x):
    return x * 2

In [14]:
df["col2"].apply(times_2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [15]:
#can also apply built in funciton 
df["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [16]:
#use a lambda expression on a data dframe 
df["col2"].apply(lambda x : x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [17]:
#Remove a column

In [18]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [19]:
df.drop("col1", axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [20]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [21]:
#get the columns in a data frame
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [22]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [23]:
#sort the data frame by a column 
df.sort_values("col2")

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [24]:
#check if any values in the frame is null 
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [25]:
#RWepeatttttt

In [27]:
dframe = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [28]:
dframe

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [29]:
dframe["col2"].unique()

array([444, 555, 666])

In [36]:
dframe.describe().transpose()

      count    mean         std    min     25%    50%     75%    max
col1    4.0    2.50    1.290994    1.0    1.75    2.5    3.25    4.0
col2    4.0  527.25  106.274409  444.0  444.00  499.5  582.75  666.0

In [38]:
dframe["col2"].nunique()

3

In [39]:
desc = dframe.describe().transpose()

In [40]:
desc

      count    mean         std    min     25%    50%     75%    max
col1    4.0    2.50    1.290994    1.0    1.75    2.5    3.25    4.0
col2    4.0  527.25  106.274409  444.0  444.00  499.5  582.75  666.0

In [51]:
desc.drop("mean", axis=1, inplace=True)

In [52]:
desc

      count         std     25%    50%     75%
col1    4.0    1.290994    1.75    2.5    3.25
col2    4.0  106.274409  444.00  499.5  582.75

In [53]:
#get the column name for the data 
dframe.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [54]:
dframe.index

RangeIndex(start=0, stop=4, step=1)